app/Controllers/Activites.php

    function showForm() {
        $objectif = new ObjectifModel();
        $objectives = $objectif->findAll();
---
SELECT *
FROM `Objectif`