app/Controllers/Gold.php

SELECT *
FROM `Gold`
 LIMIT 1
---
    function showGold()
    {
        $model = new GoldModel();
        $config = $model->findAll(1);