app/Controllers/Utilisateur.php

    public function login()
    {
        $model = new UtilisateurModel();
        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();

        if (!$user || $password != $user['motdepasse']) {
            return view('login', [
                'user' => null,
                'error' => 'Email ou mot de passe incorrect'
            ]);
        }

        session()->set('user', [
            'id' => $user['id_Utilisateur'],
            'nom' => $user['nom'],
            'email' => $user['email'],
            'argent' => $user['argent'],
            'estAdmin' => $user['estAdmin'],
            'estGold' => $user['estGold']
        ]);

        if ($user['estAdmin'] == 1) {
            $users = $model->findAll();
            return view('/backoffice/accueil-admin', ['users' => $users]);
        }

        $utiliObj = new UtilisateurObjectifModel();
        $verifier = $utiliObj->where('id_Utilisateur', $user['id_Utilisateur'])->first();

        $objectif = new ObjectifModel();
        $obj = $objectif->findAll();
---
SELECT *
FROM `Utilisateur`
WHERE `email` = 'Alice@gmail.com'
 LIMIT 1
SELECT *
FROM `UtilisateurObjectif`
WHERE `id_Utilisateur` = '1'
 LIMIT 1
SELECT *
FROM `Objectif`


        $objectifActuel = null;
        if ($verifier != null) {
            $objectifActuel = $objectif->find($verifier['id_Objectif']);
---
SELECT *
FROM `Objectif`
WHERE `Objectif`.`id_Objectif` = '2'

    public function accueil()
    {
        $user = session()->get('user');
        if (!$user) {
            return redirect()->to('/login');
        }

        $model = new UtilisateurModel();
        $userData = $model->find($user['id']);

        $objectif = new ObjectifModel();
        $obj = $objectif->findAll();

        $utiliObj = new UtilisateurObjectifModel();
        $verifier = $utiliObj->where('id_Utilisateur', $user['id'])->first();

        $objectifActuel = null;
        if ($verifier != null) {
            $objectifActuel = $objectif->find($verifier['id_Objectif']);
---
SELECT *
FROM `Objectif`
SELECT *
FROM `UtilisateurObjectif`
WHERE `id_Utilisateur` = '3'
 LIMIT 1
SELECT *
FROM `Utilisateur`
WHERE `Utilisateur`.`id_Utilisateur` = '1'
SELECT *
FROM `Objectif`
WHERE `Objectif`.`id_Objectif` = '2'
SELECT *
FROM `Utilisateur`
WHERE `Utilisateur`.`id_Utilisateur` = '3'

    public function accueilAdmin()
    {
        $user = session()->get('user');
        if (!$user || !$user['estAdmin']) {
            return redirect()->to('/login');
        }

        $userModel = new UtilisateurModel();
        $codeModel = new CodeModel();

        $users = $userModel->findAll();
        $codesEnAttente = $codeModel->where('utilise', 1)->findAll();

        foreach ($codesEnAttente as &$code) {
            $owner = !empty($code['id_Utilisateur']) ? $userModel->find($code['id_Utilisateur']) : null;
---
SELECT *
FROM `Utilisateur`
WHERE `Utilisateur`.`id_Utilisateur` = '1'