app/Controllers/Utilisateur.php

    public function accueil()
    {
        $user = session()->get('user');
        if (!$user) {
            return redirect()->to('/login');
        }

        $model = new UtilisateurModel();
        $userData = $model->find($user['id']);

        $objectif = new ObjectifModel();
        $obj = $objectif->findAll();

        $utiliObj = new UtilisateurObjectifModel();
        $verifier = $utiliObj->where('id_Utilisateur', $user['id'])->first();

        if ($verifier != null) {
            $but = $objectif->find($verifier['id_Objectif']);
---
SELECT *
FROM `Objectif`
SELECT *
FROM `UtilisateurObjectif`
WHERE `id_Utilisateur` = '1'
 LIMIT 1
SELECT *
FROM `Utilisateur`
WHERE `Utilisateur`.`id_Utilisateur` = '1'
SELECT *
FROM `Objectif`
WHERE `Objectif`.`id_Objectif` = '1'

    public function choixObjectif()
    {
        $user = session()->get('user');

        if (!$user) {
            return $this->response->setJSON(['success' => false, 'message' => 'Non authentifié']);
        }

        $objectifId = $this->request->getPost('objectif');

        if (!$objectifId) {
            return $this->response->setJSON(['success' => false, 'message' => 'Objectif manquant']);
        }

        $utiliObj = new UtilisateurObjectifModel();

        try {
            $verifier = $utiliObj->where('id_Utilisateur', $user['id'])->first();

            $infos = [
                'id_Utilisateur' => $user['id'],
                'id_Objectif' => $objectifId
            ];

            if ($verifier != null) {
                $utiliObj->update($verifier['id_UtilisateurObjectif'], $infos);
            } else {
                $utiliObj->insert($infos);
---
INSERT INTO `UtilisateurObjectif` (`id_Utilisateur`, `id_Objectif`) VALUES ('3', '1')