app/Models/RegimeModel.php

    function getRegimeObjectid()
    {
        return $this->db->table($this->table)
            ->select('Regime.*, Objectif.libelle lib_objectif')
            ->join('Objectif', 'Objectif.id_Objectif = Regime.id_Objectif')
            ->get()
            ->getResultArray();
---
SELECT `Regime`.*, `Objectif`.`libelle` `lib_objectif`
FROM `Regime`
JOIN `Objectif` ON `Objectif`.`id_Objectif` = `Regime`.`id_Objectif`